sleemanj/ATTinyCore/avr/boards.txt
attiny841opti.name=ATtiny841 (Optiboot)
attiny841opti.upload.protocol=arduino
attiny841opti.upload.maximum_size=7552
attiny841opti.upload.maximum_data_size=512
attiny841opti.upload.tool=avrdude
attiny841opti.bootloader.tool=avrdude
attiny841opti.bootloader.unlock_bits=0xFF
attiny841opti.bootloader.lock_bits=0xFF
attiny841opti.build.mcu=attiny841
attiny841opti.build.core=tinymodern
attiny841opti.build.board=AVR_ATTINY841_OPTIBOOT
attiny841opti.build.export_merged_output=false
attiny841opti.bootloader.extended_fuses=0xFE
attiny841opti.bootloader.high_fuses=0xD7
attiny841opti.menu.LTO.disable=Disabled
attiny841opti.menu.LTO.disable.ltocflags=
attiny841opti.menu.LTO.disable.ltoelfflags=
attiny841opti.menu.LTO.disable.ltocppflags=
attiny841opti.menu.LTO.disable.ltoarcmd=
attiny841opti.menu.LTO.enable=Enabled
attiny841opti.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny841opti.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attiny841opti.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attiny841opti.menu.LTO.enable.ltoarcmd=gcc-
attiny841opti.menu.clock.8internal=8 MHz (internal)
attiny841opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny841opti.menu.clock.8internal.build.f_cpu=8000000L
attiny841opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny841at8.hex
attiny841opti.menu.clock.8internal.upload.speed=57600
attiny841opti.menu.clock.16external=16 MHz (external)
attiny841opti.menu.clock.16external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.16external.build.f_cpu=16000000L
attiny841opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny841at16.hex
attiny841opti.menu.clock.16external.upload.speed=115200
attiny841opti.menu.clock.12external=12 MHz (external)
attiny841opti.menu.clock.12external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.12external.build.f_cpu=12000000L
attiny841opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny841at12.hex
attiny841opti.menu.clock.12external.upload.speed=115200
attiny841opti.menu.clock.8external=8 MHz (external)
attiny841opti.menu.clock.8external.bootloader.low_fuses=0xED
attiny841opti.menu.clock.8external.build.f_cpu=8000000L
attiny841opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny841at8.hex
attiny841opti.menu.clock.8external.upload.speed=57600
attiny841opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4v)
attiny841opti.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attiny841opti.menu.clock.8internal5v.build.f_cpu=8200000L
attiny841opti.menu.clock.8internal5v.bootloader.file=optiboot/optiboot_attiny841at8_5v.hex
attiny841opti.menu.clock.8internal5v.upload.speed=57600
attiny841opti.menu.clock.737external=7.3728 MHz (external)
attiny841opti.menu.clock.737external.bootloader.low_fuses=0xED
attiny841opti.menu.clock.737external.build.f_cpu=7372800L
attiny841opti.menu.clock.737external.bootloader.file=optiboot/optiboot_attiny841at732.hex
attiny841opti.menu.clock.737external.upload.speed=57600
attiny841opti.menu.clock.921external=9.216 MHz (external)
attiny841opti.menu.clock.921external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.921external.build.f_cpu=9216000L
attiny841opti.menu.clock.921external.bootloader.file=optiboot/optiboot_attiny841at921.hex
attiny841opti.menu.clock.921external.upload.speed=57600
attiny841opti.menu.clock.110external=11.0592 MHz (external)
attiny841opti.menu.clock.110external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.110external.build.f_cpu=11059200L
attiny841opti.menu.clock.110external.bootloader.file=optiboot/optiboot_attiny841at110.hex
attiny841opti.menu.clock.110external.upload.speed=115200
attiny841opti.menu.clock.147external=14.7456 MHz (external)
attiny841opti.menu.clock.147external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.147external.build.f_cpu=14745600L
attiny841opti.menu.clock.147external.bootloader.file=optiboot/optiboot_attiny841at147.hex
attiny841opti.menu.clock.147external.upload.speed=115200
attiny841opti.menu.clock.184external=18.432 MHz (external - overclocked)
attiny841opti.menu.clock.184external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.184external.build.f_cpu=18432000L
attiny841opti.menu.clock.184external.bootloader.file=optiboot/optiboot_attiny841at184.hex
attiny841opti.menu.clock.184external.upload.speed=115200
attiny841opti.menu.clock.20external=20 MHz (external - overclocked)
attiny841opti.menu.clock.20external.bootloader.low_fuses=0xEE
attiny841opti.menu.clock.20external.build.f_cpu=20000000L
attiny841opti.menu.clock.20external.bootloader.file=optiboot/optiboot_attiny841at20.hex
attiny841opti.menu.clock.20external.upload.speed=115200
attiny841opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny841opti.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny841opti.menu.eesave.aenable=EEPROM retained
attiny841opti.menu.eesave.aenable.bootloader.eesave_bit=0
attiny841opti.menu.eesave.disable=EEPROM not retained
attiny841opti.menu.eesave.disable.bootloader.eesave_bit=1
attiny841opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny841opti.menu.bod.1v8.bootloader.bod_bits=110
attiny841opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny841opti.menu.bod.2v7.bootloader.bod_bits=101
attiny841opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny841opti.menu.bod.4v3.bootloader.bod_bits=100
attiny841opti.menu.bodact.disabled=B.O.D. Disabled
attiny841opti.menu.bodact.disabled.bootloader.bodact_bits=11
attiny841opti.menu.bodact.enabled=B.O.D. Enabled
attiny841opti.menu.bodact.enabled.bootloader.bodact_bits=10
attiny841opti.menu.bodact.sampled=B.O.D. Sampled Mode
attiny841opti.menu.bodact.sampled.bootloader.bodact_bits=01
attiny841opti.menu.bodpd.disabled=B.O.D. Disabled
attiny841opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny841opti.menu.bodpd.enabled=B.O.D. Enabled
attiny841opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny841opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny841opti.menu.bodpd.sampled.bootloader.bodpd_bits=01


attiny828.name=ATtiny828 (No bootloader)
attiny828.upload.maximum_size=8192
attiny828.upload.maximum_data_size=512
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.bootloader.unlock_bits=0x3F
attiny828.bootloader.lock_bits=0x3F
attiny828.build.mcu=attiny828
attiny828.build.core=tinymodern
attiny828.build.board=AVR_ATTINY828
attiny828.build.export_merged_output=false
attiny828.menu.LTO.disable=Disabled
attiny828.menu.LTO.disable.ltocflags=
attiny828.menu.LTO.disable.ltoelfflags=
attiny828.menu.LTO.disable.ltocppflags=
attiny828.menu.LTO.disable.ltoarcmd=
attiny828.menu.LTO.enable=Enabled
attiny828.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny828.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attiny828.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attiny828.menu.LTO.enable.ltoarcmd=gcc-
attiny828.menu.clock.8internal=8 MHz (internal)
attiny828.menu.clock.8internal.bootloader.low_fuses=0xEE
attiny828.menu.clock.8internal.build.f_cpu=8000000L
attiny828.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny828.menu.clock.1internal=1 MHz (internal)
attiny828.menu.clock.1internal.bootloader.low_fuses=0x6E
attiny828.menu.clock.1internal.build.f_cpu=1000000L
attiny828.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny828.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny828.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1111
attiny828.menu.eesave.aenable=EEPROM retained
attiny828.menu.eesave.aenable.bootloader.eesave_bit=0
attiny828.menu.eesave.disable=EEPROM not retained
attiny828.menu.eesave.disable.bootloader.eesave_bit=1
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.bod_bits=110
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.bod_bits=101
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.bod_bits=100
attiny828.menu.bodact.disabled=B.O.D. Disabled
attiny828.menu.bodact.disabled.bootloader.bodact_bits=11
attiny828.menu.bodact.enabled=B.O.D. Enabled
attiny828.menu.bodact.enabled.bootloader.bodact_bits=10
attiny828.menu.bodact.sampled=B.O.D. Sampled Mode
attiny828.menu.bodact.sampled.bootloader.bodact_bits=01
attiny828.menu.bodpd.disabled=B.O.D. Disabled
attiny828.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny828.menu.bodpd.enabled=B.O.D. Enabled
attiny828.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny828.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny828.menu.bodpd.sampled.bootloader.bodpd_bits=01


attiny828opti.name=ATtiny828 (Optiboot)
attiny828opti.upload.maximum_size=7680
attiny828opti.upload.maximum_data_size=512
attiny828opti.upload.protocol=arduino
attiny828opti.upload.speed=57600
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.unlock_bits=0x3F
attiny828opti.bootloader.lock_bits=0x3F
attiny828opti.build.mcu=attiny828
attiny828opti.build.core=tinymodern
attiny828opti.build.board=AVR_ATTINY828
attiny828opti.build.export_merged_output=true
attiny828opti.bootloader.low_fuses=0xEE
attiny828opti.menu.LTO.disable=Disabled
attiny828opti.menu.LTO.disable.ltocflags=
attiny828opti.menu.LTO.disable.ltoelfflags=
attiny828opti.menu.LTO.disable.ltocppflags=
attiny828opti.menu.LTO.disable.ltoarcmd=
attiny828opti.menu.LTO.enable=Enabled
attiny828opti.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny828opti.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attiny828opti.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attiny828opti.menu.LTO.enable.ltoarcmd=gcc-
attiny828opti.menu.vcc.3v3=Under 4.0 V
attiny828opti.menu.vcc.3v3.build.f_cpu=8000000L
attiny828opti.menu.vcc.3v3.bootloader.file=optiboot/optiboot_attiny828at8.hex
attiny828opti.menu.vcc.5v=Over 4.0 V
attiny828opti.menu.vcc.5v.build.f_cpu=8200000L
attiny828opti.menu.vcc.5v.bootloader.file=optiboot/optiboot_attiny828at8_5v.hex
attiny828opti.bootloader.high_fuses=0b11010{bootloader.bod_bits}
attiny828opti.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1010
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.bod_bits=110
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.bod_bits=101
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.bod_bits=100
attiny828opti.menu.bodact.disabled=B.O.D. Disabled
attiny828opti.menu.bodact.disabled.bootloader.bodact_bits=11
attiny828opti.menu.bodact.enabled=B.O.D. Enabled
attiny828opti.menu.bodact.enabled.bootloader.bodact_bits=10
attiny828opti.menu.bodact.sampled=B.O.D. Sampled Mode
attiny828opti.menu.bodact.sampled.bootloader.bodact_bits=01
attiny828opti.menu.bodpd.disabled=B.O.D. Disabled
attiny828opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny828opti.menu.bodpd.enabled=B.O.D. Enabled
attiny828opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny828opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny828opti.menu.bodpd.sampled.bootloader.bodpd_bits=01


attiny1634.name=ATtiny1634 (No bootloader)
attiny1634.upload.maximum_size=16384
attiny1634.upload.maximum_data_size=1024
attiny1634.upload.tool=avrdude
attiny1634.bootloader.tool=avrdude
attiny1634.bootloader.unlock_bits=0xFF
attiny1634.bootloader.lock_bits=0xFF
attiny1634.bootloader.file=empty/empty_all.hex
attiny1634.build.mcu=attiny1634
attiny1634.build.core=tinymodern
attiny1634.build.board=AVR_ATTINY1634
attiny1634.build.export_merged_output=false
attiny1634.bootloader.extended_fuses=0xFF
attiny1634.bootloader.high_fuses=0xD7
attiny1634.menu.LTO.disable=Disabled
attiny1634.menu.LTO.disable.ltocflags=
attiny1634.menu.LTO.disable.ltoelfflags=
attiny1634.menu.LTO.disable.ltocppflags=
attiny1634.menu.LTO.disable.ltoarcmd=
attiny1634.menu.LTO.enable=Enabled
attiny1634.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny1634.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attiny1634.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attiny1634.menu.LTO.enable.ltoarcmd=gcc-
attiny1634.menu.clock.8internal=8 MHz (internal)
attiny1634.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny1634.menu.clock.8internal.build.f_cpu=8000000L
attiny1634.menu.clock.12external=12 MHz (external)
attiny1634.menu.clock.12external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.12external.build.f_cpu=12000000L
attiny1634.menu.clock.8external=8 MHz (external)
attiny1634.menu.clock.8external.bootloader.low_fuses=0xED
attiny1634.menu.clock.8external.build.f_cpu=8000000L
attiny1634.menu.clock.737external=7.372 MHz (external)
attiny1634.menu.clock.737external.bootloader.low_fuses=0xED
attiny1634.menu.clock.737external.build.f_cpu=7372800L
attiny1634.menu.clock.92external=9.216 MHz (external)
attiny1634.menu.clock.92external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.92external.build.f_cpu=9216000L
attiny1634.menu.clock.11external=11.0592 MHz (external)
attiny1634.menu.clock.11external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.11external.build.f_cpu=11059200L
attiny1634.menu.clock.143external=14.7456 MHz (external - overclocked)
attiny1634.menu.clock.143external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.143external.build.f_cpu=14745600L
attiny1634.menu.clock.6external=6 MHz (external)
attiny1634.menu.clock.6external.bootloader.low_fuses=0xED
attiny1634.menu.clock.6external.build.f_cpu=6000000L
attiny1634.menu.clock.4external=4 MHz (external)
attiny1634.menu.clock.4external.bootloader.low_fuses=0xED
attiny1634.menu.clock.4external.build.f_cpu=6000000L
attiny1634.menu.clock.1internal=1 MHz (internal)
attiny1634.menu.clock.1internal.bootloader.low_fuses=0x62
attiny1634.menu.clock.1internal.build.f_cpu=1000000L
attiny1634.menu.clock.16external=16 MHz (external - overclocked)
attiny1634.menu.clock.16external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.16external.build.f_cpu=16000000L
attiny1634.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny1634.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634.menu.eesave.aenable=EEPROM retained
attiny1634.menu.eesave.aenable.bootloader.eesave_bit=0
attiny1634.menu.eesave.disable=EEPROM not retained
attiny1634.menu.eesave.disable.bootloader.eesave_bit=1
attiny1634.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634.menu.bod.1v8.bootloader.bod_bits=110
attiny1634.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634.menu.bod.2v7.bootloader.bod_bits=101
attiny1634.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634.menu.bod.4v3.bootloader.bod_bits=100
attiny1634.menu.bodact.disabled=B.O.D. Disabled
attiny1634.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634.menu.bodact.enabled=B.O.D. Enabled
attiny1634.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634.menu.bodpd.disabled=B.O.D. Disabled
attiny1634.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634.menu.bodpd.enabled=B.O.D. Enabled
attiny1634.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634.menu.bodpd.sampled.bootloader.bodpd_bits=01

